---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.#ctor
source: html/0c7d6364-4b7e-2787-4cce-71da9741a340.htm
---
# Autodesk.Revit.DB.Electrical.WireMaterialTypeSet.#ctor Method

Initializes a new instance of the WireMaterialTypeSet class

## Syntax (C#)
```csharp
public WireMaterialTypeSet()
```